SELECT EXISTS (
    SELECT 1
    FROM Н_ЛЮДИ
    JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
    JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    JOIN Н_ГРУППЫ_ПЛАНОВ ON Н_УЧЕНИКИ.ГРУППА = Н_ГРУППЫ_ПЛАНОВ.ГРУППА
    JOIN Н_ЭЛЕМЕНТЫ_СТРОК ON Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД = Н_ЭЛЕМЕНТЫ_СТРОК.СПЛ_ИД
    JOIN Н_СВОЙСТВА_ОТДЕЛОВ ON Н_ЭЛЕМЕНТЫ_СТРОК.ОТД_ИД = Н_СВОЙСТВА_ОТДЕЛОВ.ИД
    WHERE Н_СВОЙСТВА_ОТДЕЛОВ.НАИМЕНОВАНИЕ = 'ФКТИУ'
      AND DATE_PART('year', AGE(CURRENT_DATE, Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ)) < 20
);
