import re
'''
468013 % 8 = 5
'''
# Исходный список студентов
students = [["Петров П.П. P0000","Анищенко А.А. P33113","Примеров Е.В. P0000","Иванов И.И. P0000"],["Афанасьев А.А. P0000",
    "Иванов И.И. P0000",
    "Смирнов С.С. P0000",
    "Иванов И.И. P33113",
    "Петров П.П. P0000"],["Сидоров П.П. P0000",
    "Анищенко И.А. P3311",
    "Примеров Е.В. P0000",
    "Иванов И.Е. P0000"],["Петров-Иванов И.П. P0000",
    "Анищенко А.А. P33113",
    "Григорьев Г.Г. P0000",
    "Григорьев У.Г. P0000",                      
    "Смирнов С.С. P0000"],["Иванов И.И. P0000",
    "Сидоров С.С. P0000",
    "Петров П.П. P0000",
    "Смирнов С.С. P0000"]]


# Словарь для хранения студентов по инициалам
initials_map = {}
res = [[],[],[],[],[]]
ind = 0
# Заполняем словарь
for i in students:
    for student in i:
        match = re.match(r"(.+)\s+([А-ЯЁ]\.[А-ЯЁ]\.)\s+([P]\d+)",student)
        if match:
            full_name = match.group(1)
     
            initials = match.group(2)
            group = match.group(3)
            
            if ((full_name[0]) != (initials[0]) != (initials[-2])) or len(group)>5:
                res[ind].append(student)
    ind+=1

for i in res:
    for student in i:
        print(student)
    print('-------------')
